---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForMergePartFailures.PartsCannotBeMerged
source: html/c2c4873c-7f22-c96d-6919-28f8e6a80375.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForMergePartFailures.PartsCannotBeMerged Property

This PartMaker refers to parts which cannot be merged.

## Syntax (C#)
```csharp
public static FailureDefinitionId PartsCannotBeMerged { get; }
```